In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [2]:
marathon_2016 = pd.read_csv("./data/marathon_2016.csv")

In [3]:
marathon_2016

      Unnamed: 0  Overall    Bib                     Name      Time
0              0        1      1           Scott Wietecha  02:25:42
1              1        2      3            Brian Shelton  02:34:43
2              2        3   1047        Christopher Capps  02:38:43
3              3        4   1052             Jason Grimes  02:45:06
4              4        5   1046              David Adams  02:47:28
...          ...      ...    ...                      ...       ...
3837        3837    99999  21159               Beth Lyons  00:00:00
3838        3838    99999  25061          Aleksei Stevens  00:00:00
3839        3839    99999   6047          Lizzie Ziccardi  00:00:00
3840        3840    99999   2052             Adam Pastors  00:00:00
3841        3841    99999   2107  Anastasiya Christiansen  00:00:00

[3842 rows x 5 columns]

In [4]:
marathon_2017 = pd.read_csv("./data/marathon_2017.csv")

In [5]:
marathon_2017

      Unnamed: 0  Overall    Bib             Name      Time
0              0        1      1   Scott Wietecha  02:40:25
1              1        2   1145     Ryan Regnier  02:56:28
2              2        3   1147   Daniel Everett  03:00:55
3              3        4   1029    Khris Vickroy  03:04:47
4              4        5   1119   Marcus Dilallo  03:04:53
...          ...      ...    ...              ...       ...
3646        3646    99999   1185       Ernest Lee  00:00:00
3647        3647    99999   8038  Allison Alfonso  00:00:00
3648        3648    99999  26069   Justin Wehring  00:00:00
3649        3649    99999   8111   Timothy Forbes  00:00:00
3650        3650    99999   2084    Thomas Hansen  00:00:00

[3651 rows x 5 columns]

In [6]:
marathon_2018 = pd.read_csv("./data/marathon_2018.csv")

In [7]:
marathon_2018

      Unnamed: 0  Overall    Bib             Name      Time
0              0        1      1   Scott Wietecha  02:28:16
1              1        2      3     Garang Madut  02:29:52
2              2        3  33442       Kevin Fink  02:38:59
3              3        4  33441    Andrew Hodges  02:43:59
4              4        5  30028  Nicholas Aubert  02:48:11
...          ...      ...    ...              ...       ...
2110        2110    99999  33654      Jeff Ekkart  00:00:00
2111        2111    99999  31170   Austin Perkins  00:00:00
2112        2112    99999  30482      David Ramos  00:00:00
2113        2113    99999  33461   Emily Eagerton  00:00:00
2114        2114    99999  31515  Tony Quernemoen  00:00:00

[2115 rows x 5 columns]

In [8]:
marathon_2019 = pd.read_csv("./data/marathon_2019.csv")

In [9]:
marathon_half_2016 = pd.read_csv("./data/marathon_half_2016.csv")

In [10]:
marathon_half_2017 = pd.read_csv("./data/marathon_half_2017.csv")

In [11]:
marathon_half_2018 = pd.read_csv("./data/marathon_half_2018.csv")

In [12]:
marathon_half_2019 = pd.read_csv("./data/marathon_half_2019.csv")

In [13]:
marathon_2016.shape

(3842, 5)

In [14]:
marathon_2017.shape

(3651, 5)

In [15]:
marathon_2018.shape

(2115, 5)

In [16]:
marathon_2019.shape

(2811, 5)

In [17]:
marathon_half_2016.shape

(22429, 5)

In [18]:
marathon_half_2017.shape

(22292, 5)

In [19]:
marathon_2016.head(20)

    Unnamed: 0  Overall    Bib               Name      Time
0            0        1      1     Scott Wietecha  02:25:42
1            1        2      3      Brian Shelton  02:34:43
2            2        3   1047  Christopher Capps  02:38:43
3            3        4   1052       Jason Grimes  02:45:06
4            4        5   1046        David Adams  02:47:28
5            5        6   1049    Matthew Meinema  02:47:36
6            6        7   1044        Seth Carley  02:48:22
7            7        8   1092         Ben Becker  02:52:19
8            8        9   1057     Jonathan Mason  02:53:38
9            9       10   1058         Matt Treat  02:53:48
10          10       11   1067     Kevin Selinsky  02:55:49
11          11       12   1069      Cole Bataille  02:56:56
12          12       13   1087     Joseph Shields  02:58:53
13          13       14   1108     Melanie Kulesz  02:59:09
14          14       15   2014       Kieran Frost  02:59:30
15          15       16   1155        Brian Wiest  02:59:51
16          16       17   1048     Braden Robbins  03:00:26
17          17       18   1080          Bo Brewer  03:01:09
18          18       19  27408      Bryan Larison  03:01:23
19          19       20    101        Megan Hovis  03:04:49

In [20]:
marathon_2016 = marathon_2016.drop(columns = 'Unnamed: 0')

In [21]:
marathon_2017 = marathon_2017.drop(columns = 'Unnamed: 0')
marathon_2018 = marathon_2018.drop(columns = 'Unnamed: 0')
marathon_2019 = marathon_2019.drop(columns = 'Unnamed: 0')

In [22]:
marathon_half_2016 = marathon_half_2016.drop(columns = "Unnamed: 0")
marathon_half_2017 = marathon_half_2017.drop(columns = "Unnamed: 0")
marathon_half_2018 = marathon_half_2018.drop(columns = "Unnamed: 0")
marathon_half_2019 = marathon_half_2019.drop(columns = "Unnamed: 0")

In [23]:
marathon_half_2019

       Overall   Bib              Name      Time
0            1    31       Nick French  01:10:03
1            2    33      Ian Bordelon  01:12:15
2            3    32     Chris Demetra  01:12:52
3            4  1025      Grayson Reid  01:15:10
4            5    34      Jason Vincze  01:17:01
...        ...   ...               ...       ...
17231    99999  1014      Ian Bordelon  00:00:00
17232    99999  1012      Nick Gehlsen  00:00:00
17233    99999  6295  Arsenio Franklin  00:00:00
17234    99999  4922         Matt Lang  00:00:00
17235    99999  1528        Kyle Eason  00:00:00

[17236 rows x 4 columns]

In [24]:
marathon_2016

      Overall    Bib                     Name      Time
0           1      1           Scott Wietecha  02:25:42
1           2      3            Brian Shelton  02:34:43
2           3   1047        Christopher Capps  02:38:43
3           4   1052             Jason Grimes  02:45:06
4           5   1046              David Adams  02:47:28
...       ...    ...                      ...       ...
3837    99999  21159               Beth Lyons  00:00:00
3838    99999  25061          Aleksei Stevens  00:00:00
3839    99999   6047          Lizzie Ziccardi  00:00:00
3840    99999   2052             Adam Pastors  00:00:00
3841    99999   2107  Anastasiya Christiansen  00:00:00

[3842 rows x 4 columns]

In [25]:
marathon_2016.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3842 entries, 0 to 3841
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Overall  3842 non-null   int64
 1   Bib      3842 non-null   int64
 2   Name     3842 non-null   object
 3   Time     3842 non-null   object
dtypes: int64(2), object(2)
memory usage: 120.2+ KB

In [33]:
marathon_2016['Time'] = pd.to_datetime(marathon_2016['Time'])
marathon_2017['Time'] = pd.to_datetime(marathon_2017['Time'])
marathon_2018['Time'] = pd.to_datetime(marathon_2018['Time'])
marathon_2019['Time'] = pd.to_datetime(marathon_2019['Time'])
marathon_half_2016['Time'] = pd.to_datetime(marathon_half_2016['Time'])
marathon_half_2017['Time'] = pd.to_datetime(marathon_half_2017['Time'])
marathon_half_2018['Time'] = pd.to_datetime(marathon_half_2018['Time'])
marathon_half_2019['Time'] = pd.to_datetime(marathon_half_2019['Time'])

In [34]:
marathon_2016.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3842 entries, 0 to 3841
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Overall  3842 non-null   int64
 1   Bib      3842 non-null   int64
 2   Name     3842 non-null   object
 3   Time     3842 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 120.2+ KB

In [37]:
marathon_2016_time_count = marathon_2016.Time.value_counts()
marathon_2017_time_count = marathon_2017.Time.value_counts()
marathon_2018_time_count = marathon_2018.Time.value_counts()
marathon_2019_time_count = marathon_2019.Time.value_counts()
marathon_half_2016_time_count = marathon_half_2016.Time.value_counts()
marathon_half_2017_time_count = marathon_half_2017.Time.value_counts()
marathon_half_2018_time_count = marathon_half_2018.Time.value_counts()
marathon_half_2019_time_count = marathon_half_2019.Time.value_counts()

In [50]:
marathon_2016_time_count.head()

2020-11-23 00:00:00    864
2020-11-23 04:53:54      5
2020-11-23 04:26:28      4
2020-11-23 05:02:13      4
2020-11-23 03:58:51      4
Name: Time, dtype: int64

In [39]:
marathon_2017_time_count.head()

2020-11-23 00:00:00    1056
2020-11-23 05:10:10       5
2020-11-23 05:13:01       5
2020-11-23 04:47:07       4
2020-11-23 05:40:07       4
Name: Time, dtype: int64

In [40]:
marathon_2018_time_count.head()

2020-11-23 00:00:00    8
2020-11-23 04:30:58    5
2020-11-23 05:51:14    4
2020-11-23 05:18:51    4
2020-11-23 04:24:58    4
Name: Time, dtype: int64

In [41]:
marathon_2019_time_count.head()

2020-11-23 00:00:00    786
2020-11-23 04:55:52      4
2020-11-23 05:14:27      4
2020-11-23 04:26:51      4
2020-11-23 04:58:32      4
Name: Time, dtype: int64

In [42]:
marathon_half_2016_time_count.head()

2020-11-23 00:00:00    4509
2020-11-23 02:17:14      13
2020-11-23 02:15:06      12
2020-11-23 02:18:20      12
2020-11-23 02:18:04      11
Name: Time, dtype: int64

In [43]:
marathon_half_2017_time_count.head()

2020-11-23 00:00:00    4580
2020-11-23 02:42:29      13
2020-11-23 02:17:56      13
2020-11-23 02:26:38      12
2020-11-23 02:23:56      11
Name: Time, dtype: int64

In [51]:
marathon_half_2018_time_count.head()

2020-11-23 02:24:09    12
2020-11-23 02:13:32    11
2020-11-23 02:08:14    11
2020-11-23 02:22:53    10
2020-11-23 02:45:37    10
Name: Time, dtype: int64

In [45]:
marathon_half_2019_time_count.head()

2020-11-23 00:00:00    3530
2020-11-23 02:49:53      10
2020-11-23 01:53:52      10
2020-11-23 02:22:37      10
2020-11-23 02:27:45      10
Name: Time, dtype: int64

In [53]:
marathon_half_2018

       Overall    Bib             Name                Time
0            1    103   Roosevelt Cook 2020-11-23 01:09:25
1            2    107     Lucas Cotter 2020-11-23 01:09:51
2            3    105      Nick French 2020-11-23 01:10:38
3            4    106     Jason Vincze 2020-11-23 01:11:50
4            5    104    Joseph Elsakr 2020-11-23 01:13:28
...        ...    ...              ...                 ...
14935    14935   8337  Kayleah Maddock 2020-11-23 06:04:28
14936    14937  32614    Kim Donaldson 2020-11-23 06:05:35
14937    14938  31720    Pamela Hagens 2020-11-23 06:12:15
14938    14939  33664      Fatima Rego 2020-11-23 06:12:24
14939    14940  33532      Annie Friar 2020-11-23 06:26:37

[14940 rows x 4 columns]

In [54]:
marathon_half_2017

       Overall    Bib              Name                Time
0            1    202     Tyler Andrews 2020-11-23 01:10:58
1            2    204       Bill Martin 2020-11-23 01:11:25
2            3    206       Nick French 2020-11-23 01:11:42
3            4    201    Roosevelt Cook 2020-11-23 01:13:20
4            5   1655       Erick Kigen 2020-11-23 01:14:56
...        ...    ...               ...                 ...
22287    99999  37356     Joseph Holder 2020-11-23 00:00:00
22288    99999  28230       Beth Fritch 2020-11-23 00:00:00
22289    99999   2618     Kevin Huffman 2020-11-23 00:00:00
22290    99999  21283    Harmon Roberts 2020-11-23 00:00:00
22291    99999  11428  Coreen Donaldson 2020-11-23 00:00:00

[22292 rows x 4 columns]

In [102]:
marathon_2016_zero = marathon_2016.loc[marathon_2016['Time'] == '00:00:00']
marathon_2017_zero = marathon_2017.loc[marathon_2017['Time'] == '00:00:00']
marathon_2018_zero = marathon_2018.loc[marathon_2018['Time'] == '00:00:00']
marathon_2019_zero = marathon_2019.loc[marathon_2019['Time'] == '00:00:00']
marathon_half_2016_zero = marathon_half_2016.loc[marathon_half_2016['Time'] == '00:00:00']
marathon_half_2017_zero = marathon_half_2017.loc[marathon_half_2017['Time'] == '00:00:00']
marathon_half_2018_zero = marathon_half_2018.loc[marathon_half_2018['Time'] == '00:00:00']
marathon_half_2019_zero = marathon_half_2019.loc[marathon_half_2019['Time'] == '00:00:00']

In [103]:
marathon_2016_zero

      Overall    Bib                     Name       Time
2952    99999  27326            Ashley Newton 2020-11-23
2953    99999   2031             Thomas Sirna 2020-11-23
2954    99999   4027          Sulaiman Seriki 2020-11-23
2955    99999  17252          Carol Mulderink 2020-11-23
2956    99999  27291                Mark Warf 2020-11-23
...       ...    ...                      ...        ...
3837    99999  21159               Beth Lyons 2020-11-23
3838    99999  25061          Aleksei Stevens 2020-11-23
3839    99999   6047          Lizzie Ziccardi 2020-11-23
3840    99999   2052             Adam Pastors 2020-11-23
3841    99999   2107  Anastasiya Christiansen 2020-11-23

[864 rows x 4 columns]

In [104]:
marathon_2018_zero

      Overall    Bib             Name       Time
2107    99999  33530   Brandon Wynsma 2020-11-23
2108    99999  32166       Janna Chew 2020-11-23
2109    99999  31683    Aubrey Spaeth 2020-11-23
2110    99999  33654      Jeff Ekkart 2020-11-23
2111    99999  31170   Austin Perkins 2020-11-23
2112    99999  30482      David Ramos 2020-11-23
2113    99999  33461   Emily Eagerton 2020-11-23
2114    99999  31515  Tony Quernemoen 2020-11-23

In [105]:
marathon_half_2019_zero

       Overall    Bib                 Name       Time
13706    99999  13115       Zachary Winter 2020-11-23
13707    99999   7616      Kristin Bridges 2020-11-23
13708    99999  11327    Natalie Saldajeno 2020-11-23
13709    99999  11396  Carla Seeley Greene 2020-11-23
13710    99999  11206              Tim Ray 2020-11-23
...        ...    ...                  ...        ...
17231    99999   1014         Ian Bordelon 2020-11-23
17232    99999   1012         Nick Gehlsen 2020-11-23
17233    99999   6295     Arsenio Franklin 2020-11-23
17234    99999   4922            Matt Lang 2020-11-23
17235    99999   1528           Kyle Eason 2020-11-23

[3530 rows x 4 columns]

In [108]:
marathon_2016_zero

AttributeError: 'function' object has no attribute 'value_counts'